# taps
tap "homebrew/core"
tap "homebrew/cask"

# formula
brew "bash"
brew "curl"
brew "fish"
brew "fzf"
brew "gdub"
brew "git"
brew "htop"
brew "jq"
brew "kubernetes-cli"
brew "mas"
brew "ncdu"
brew "nmap"
brew "parallel"
brew "python"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "vegeta"
brew "watch"
brew "yadm"

# casks
cask "alacritty"
cask "beyond-compare"
cask "bitwarden"
cask "charles"
cask "cyberduck"
cask "dash"
cask "day-o"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "java"
cask "java6"
cask "jetbrains-toolbox"
cask "keepassxc"
cask "keybase"
cask "microsoft-teams"
cask "onedrive"
cask "pocket-casts"
cask "postman"
cask "skype-for-business"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "telegram"
cask "the-unarchiver"
cask "visual-studio-code"
cask "visualvm"
cask "vlc"
cask "whatsapp"
cask "zulu8"

# AppStore
mas "Pixelmator", id: 407963104